; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=52, out_folder=htg/blocksworld//training, instance_id=32, seed=2056

(define (problem blocksworld-32)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 - object)
 (:init 
    (arm-empty)
    (clear b37)
    (on b37 b41)
    (on b41 b47)
    (on-table b47)
    (clear b5)
    (on-table b5)
    (clear b43)
    (on-table b43)
    (clear b36)
    (on b36 b44)
    (on-table b44)
    (clear b14)
    (on b14 b3)
    (on-table b3)
    (clear b35)
    (on b35 b18)
    (on b18 b26)
    (on b26 b48)
    (on b48 b32)
    (on b32 b19)
    (on b19 b31)
    (on b31 b40)
    (on b40 b22)
    (on b22 b42)
    (on b42 b34)
    (on b34 b12)
    (on b12 b23)
    (on-table b23)
    (clear b24)
    (on-table b24)
    (clear b8)
    (on b8 b20)
    (on b20 b29)
    (on b29 b39)
    (on b39 b45)
    (on b45 b16)
    (on b16 b10)
    (on b10 b9)
    (on b9 b49)
    (on b49 b21)
    (on b21 b4)
    (on b4 b50)
    (on b50 b27)
    (on b27 b30)
    (on b30 b1)
    (on b1 b6)
    (on b6 b15)
    (on b15 b25)
    (on b25 b2)
    (on b2 b7)
    (on b7 b11)
    (on b11 b13)
    (on b13 b28)
    (on b28 b52)
    (on b52 b51)
    (on b51 b17)
    (on b17 b38)
    (on b38 b46)
    (on b46 b33)
    (on-table b33))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b3)
    (on b3 b1)
    (on b1 b5)
    (on b5 b2)
    (on-table b2))))

; plan
1. (unstack b14 b3)
   deleted: (on b14 b3) (clear b14) (arm-empty)
   added: (holding b14) (clear b3)
   goals met: 1 of 7
2. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 7
3. (unstack b8 b20)
   deleted: (on b8 b20) (clear b8) (arm-empty)
   added: (holding b8) (clear b20)
   goals met: 1 of 7
4. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 7
5. (unstack b20 b29)
   deleted: (on b20 b29) (clear b20) (arm-empty)
   added: (holding b20) (clear b29)
   goals met: 1 of 7
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 7
7. (unstack b29 b39)
   deleted: (on b29 b39) (clear b29) (arm-empty)
   added: (holding b29) (clear b39)
   goals met: 1 of 7
8. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 1 of 7
9. (unstack b39 b45)
   deleted: (on b39 b45) (clear b39) (arm-empty)
   added: (holding b39) (clear b45)
   goals met: 1 of 7
10. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 1 of 7
11. (unstack b45 b16)
   deleted: (on b45 b16) (clear b45) (arm-empty)
   added: (holding b45) (clear b16)
   goals met: 1 of 7
12. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 1 of 7
13. (unstack b16 b10)
   deleted: (on b16 b10) (clear b16) (arm-empty)
   added: (holding b16) (clear b10)
   goals met: 1 of 7
14. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 7
15. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 1 of 7
16. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 7
17. (unstack b9 b49)
   deleted: (on b9 b49) (clear b9) (arm-empty)
   added: (holding b9) (clear b49)
   goals met: 1 of 7
18. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 7
19. (unstack b49 b21)
   deleted: (on b49 b21) (clear b49) (arm-empty)
   added: (holding b49) (clear b21)
   goals met: 1 of 7
20. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 1 of 7
21. (unstack b21 b4)
   deleted: (on b21 b4) (clear b21) (arm-empty)
   added: (holding b21) (clear b4)
   goals met: 2 of 7
22. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 7
23. (unstack b4 b50)
   deleted: (on b4 b50) (clear b4) (arm-empty)
   added: (holding b4) (clear b50)
   goals met: 1 of 7
24. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 7
25. (unstack b50 b27)
   deleted: (on b50 b27) (clear b50) (arm-empty)
   added: (holding b50) (clear b27)
   goals met: 3 of 7
26. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 3 of 7
27. (unstack b27 b30)
   deleted: (on b27 b30) (clear b27) (arm-empty)
   added: (holding b27) (clear b30)
   goals met: 3 of 7
28. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 3 of 7
29. (unstack b30 b1)
   deleted: (on b30 b1) (clear b30) (arm-empty)
   added: (holding b30) (clear b1)
   goals met: 3 of 7
30. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 3 of 7
31. (unstack b1 b6)
   deleted: (on b1 b6) (clear b1) (arm-empty)
   added: (holding b1) (clear b6)
   goals met: 3 of 7
32. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 4 of 7
33. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 7
34. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 5 of 7
35. (unstack b6 b15)
   deleted: (on b6 b15) (clear b6) (arm-empty)
   added: (holding b6) (clear b15)
   goals met: 5 of 7
36. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 7
37. (unstack b15 b25)
   deleted: (on b15 b25) (clear b15) (arm-empty)
   added: (holding b15) (clear b25)
   goals met: 5 of 7
38. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 7
39. (unstack b25 b2)
   deleted: (on b25 b2) (clear b25) (arm-empty)
   added: (holding b25) (clear b2)
   goals met: 5 of 7
40. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 5 of 7
41. (unstack b2 b7)
   deleted: (on b2 b7) (clear b2) (arm-empty)
   added: (holding b2) (clear b7)
   goals met: 5 of 7
42. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 7
43. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 4 of 7
44. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 5 of 7
45. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 4 of 7
46. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 7
47. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 4 of 7
48. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 5 of 7
49. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 7
50. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 6 of 7
51. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 5 of 7
52. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 7 of 7
